/************************************************************************
* 版权所有 (C)2020, 成都熊谷加世有限公司。
* 
* 文件名称： // can_app.h
* 文件标识： // 适用于can  公共头文件
* 内容摘要： //
* 其它说明： // 
* 当前版本： // Ver1.0
* 作    者： // 
* 完成日期： // 20200520
* 
************************************************************************/

#ifndef __CAN_APP__H__
#define __CAN_APP__H__
#include <linux/can.h>
#include <linux/can/raw.h>

typedef int (*CANCallback_fun)(struct can_frame *can_data);
/***************************************
接收处理函数格式
***************************************/

int Set_CanReceive_Fun(CANCallback_fun Receive_Fun);

/***************************************
设置接收处理函数
***************************************/

int Start_CanReceive(char *candev);

/***************************************
启动CAN接收发送(can0/can1)
***************************************/

int Send_Can_Data(struct can_frame *can_data);
/***************************************
发送函数
***************************************/

#endif


